Revit 2024 API
ObjectType Enumeration
This enumerated type contains object types allowed to be selected during selection operations.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ObjectType
Visual Basic
Public Enumeration ObjectType
Visual C++
public enum class ObjectType
Members
Member name | Description
Nothing |  Nothing.
Element |  Whole element.
PointOnElement |  Any point on an element (on a face or curve).
Edge |  Any model edge.
Face |  Any face.
LinkedElement |  Elements in linked RVT files.
Subelement |  Whole element or subelement.
See Also
Autodesk.Revit.UI.Selection Namespace